samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
/**
 * @file active_object_test.cpp
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief Active Object design pattern test 
 * 
 * @version 0.1
 * @date 2024-03-21
 * 
 * @copyright Copyright (c) 2024
 * 
 */

//=======================================================================================
// Includes 

#include "active_object_test.h" 
#include "includes_drivers.h" 
#include "stm32f4xx_it.h" 

// FreeRTOS 
#include "FreeRTOS.h"
#include "task.h"
#include "cmsis_os2.h"
#include "queue.h" 
#include "semphr.h" 
#include "timers.h" 

//=======================================================================================


//=======================================================================================
// Macros 

// Conditional compilation 
#define AO_C_TEST 0 
#define AO_CPP_TEST 0 

// Memory 
#define MIN_STACK_MULTIPLE 8 
#define THREAD_LOW_STACK_SIZE configMINIMAL_STACK_SIZE * MIN_STACK_MULTIPLE 
#define THREAD_HIGH_STACK_SIZE configMINIMAL_STACK_SIZE * MIN_STACK_MULTIPLE 

// Data 
#define SERIAL_INPUT_MAX_LEN 30 

// Timing 
#define LED_SLOW_BLINK_PERIOD 500   // (ticks) 
#define LED_FAST_BLINK_PERIOD 100   // (ticks) 

//=======================================================================================


//=======================================================================================
// Active Object module data 

//==================================================
// Datatype 

typedef uint8_t Event; 

//==================================================

//==================================================
// Objects 

// Thread Event Info 
typedef struct 
{
    osThreadAttr_t attr;              // Thread attributes 
    uint8_t event;                    // Event index 
    QueueHandle_t ThreadEventQueue;   // Queue 
    void (*dispatch)(Event event);    // Dispatch function 
}
ThreadEventData; 

//==================================================

//==================================================
// Prototypes 

/**
 * @brief Common event loop shared by all threads 
 * 
 * @param thread_info : thread info such as the event queue handler and dispatch function 
 */
void eventLoop(void *thread_info); 

//==================================================

//=======================================================================================


//=======================================================================================
// Low Priority Thread module data 

// Local data to the low priority thread 

//==================================================
// Enums 

// Low Priority Thread states 
typedef enum {
    THREAD_LOW_SERIAL_OUT_STATE, 
    THREAD_LOW_SERIAL_IN_STATE, 
    THREAD_LOW_NUM_STATES 
} ThreadLowStates; 

// Low Priority Thread event indexes 
typedef enum {
    THREAD_LOW_NO_EVENT, 
    THREAD_LOW_SERIAL_OUT_EVENT, 
    THREAD_LOW_SERIAL_IN_EVENT 
} ThreadLowEvents; 

//==================================================

//==================================================
// Objects 

// Low Priority Thread trackers 
struct ThreadLowTrackers 
{
    // System info 
    ThreadEventData event_data; 
    ThreadLowStates state; 

    // Serial terminal data 
    uint8_t uart_dma_buff[SERIAL_INPUT_MAX_LEN];   // Circular buffer 
    uint8_t buff_index;                            // Circular buffer index 
    uint8_t user_in_buff[SERIAL_INPUT_MAX_LEN];    // Stores latest user input 

    // State flags 
    uint8_t state_entry : 1; 
    uint8_t serial_out  : 1; 
    uint8_t serial_in   : 1; 
}; 

// Low Priority Thread object 
static ThreadLowTrackers thread_low_trackers; 

//==================================================

//==================================================
// Variables 

// Queue info 
static const uint8_t thread_low_queue_len = 3; 

//==================================================

//==================================================
// Function pointers 

// State function pointers 
typedef void (*thread_low_state_ptr)(ThreadLowTrackers *trackers, Event event); 

//==================================================

//==================================================
// Prototypes 

// Setup 
void ThreadLowSetup(void); 

// Dispatch functions 
void DispatchThreadLow(Event event); 

// State functions 
void ThreadLowState0(ThreadLowTrackers *trackers, Event event); 
void ThreadLowState1(ThreadLowTrackers *trackers, Event event); 

//==================================================

//==================================================
// Control data 

// Low Priority Thread state table 
static const thread_low_state_ptr thread_low_state_table[THREAD_LOW_NUM_STATES] = 
{
    &ThreadLowState0,   // State 0 
    &ThreadLowState1    // State 1 
}; 

//==================================================

//=======================================================================================


//=======================================================================================
// High Priority Thread module data 

// Local data to the high priority thread 

//==================================================
// Enums 

// High Priority thread states 
typedef enum {
    THREAD_HIGH_LED_SLOW_STATE, 
    THREAD_HIGH_LED_FAST_STATE, 
    THREAD_HIGH_NUM_STATES 
} ThreadHighStates; 

// High Priority Thread event indexes 
typedef enum {
    THREAD_HIGH_NO_EVENT, 
    THREAD_HIGH_LED_TOGGLE_EVENT 
} ThreadHighEvents; 

//==================================================

//==================================================
// Objects 

// High Priority Thread trackers 
struct ThreadHighTrackers 
{
    // System info 
    ThreadEventData event_data; 
    ThreadHighStates state; 

    // LED timers 
    TimerHandle_t slow_blink_timer; 
    TimerHandle_t fast_blink_timer; 

    // LED pin data 
    GPIO_TypeDef *led_gpio; 
    gpio_pin_num_t led_pin; 
    gpio_pin_state_t led_state; 

    // State flags 
    uint8_t state_entry : 1; 
    uint8_t led_slow    : 1; 
    uint8_t led_fast    : 1; 
}; 

