samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
// High Priority Thread object 
static ThreadHighTrackers thread_high_trackers; 

//==================================================

//==================================================
// Variables 

// Queue info 
static const uint8_t thread_high_queue_len = 3; 

//==================================================

//==================================================
// Function pointers 

// State function pointers 
typedef void (*thread_high_state_ptr)(ThreadHighTrackers *trackers, Event event); 

//==================================================

//==================================================
// Prototypes 

// Setup 
void ThreadHighSetup(void); 

// Dispatch functions 
void DispatchThreadHigh(Event event); 

// State functions 
void ThreadHighState0(ThreadHighTrackers *trackers, Event event); 
void ThreadHighState1(ThreadHighTrackers *trackers, Event event); 

// Helper functions 
void ThreadHighStateToggle(void); 

//==================================================

//==================================================
// Control data 

// High Priority Thread state table 
static const thread_high_state_ptr thread_high_state_table[THREAD_HIGH_NUM_STATES] = 
{
    &ThreadHighState0,   // State 0 
    &ThreadHighState1    // State 1 
}; 

//==================================================

//=======================================================================================


//=======================================================================================
// Software Timer Thread 

//==================================================
// Prototypes 

// Called when LED toggle timers expire 
void LEDTimerCallback(TimerHandle_t xTimer); 

//==================================================

//=======================================================================================


//=======================================================================================
// Event module(s) 

//==================================================
// Prototypes 

// Events 
void SerialOutEvent(char *output_buff); 
void SerialInEvent(
    uint8_t *circular_buff, 
    uint8_t *circular_buff_index, 
    uint8_t *input_buff); 
void PinToggleEvent(
    GPIO_TypeDef *pin_gpio, 
    gpio_pin_num_t pin_num, 
    gpio_pin_state_t *pin_state); 

//==================================================

//=======================================================================================


//=======================================================================================
// Test functions 

// Active Object test setup code 
void active_object_test_init(void)
{
    // Initialize FreeRTOS scheduler 
    osKernelInitialize(); 

    //==================================================
    // Other general setup (pins, ports, etc.) 

    // Initialize GPIO ports 
    gpio_port_init(); 

    //==================================================

    // Priority group setup 
    ThreadLowSetup(); 
    ThreadHighSetup(); 
}


// Active Object test code 
void active_object_test_app(void)
{
    // Start scheduler 
    osKernelStart(); 
}

//=======================================================================================


//=======================================================================================
// Active Object control 

// In practice the event loop and any other context switching or thread related code 
// should be in it's own file. The event loop would then dispatch to the thread it's 
// running in a different file. 

// Common event loop shared by all threads 
void eventLoop(void *thread_info)
{
    ThreadEventData *thread = (ThreadEventData *)thread_info; 

    // Event loop 
    while (1)
    {
        thread->event = CLEAR; 
        xQueueReceive(thread->ThreadEventQueue, (void *)&thread->event, portMAX_DELAY); 
        thread->dispatch(thread->event); 
    }

    vTaskDelete(NULL); 
}

//=======================================================================================


//=======================================================================================
// Low Priority Thread event control 

// In practice these dispatch functions would likely be separated into different files 
// to help organize the code. 

// Setup 
void ThreadLowSetup(void)
{
    // Initialize general data 
    thread_low_trackers.state = THREAD_LOW_SERIAL_OUT_STATE; 
    memset((void *)thread_low_trackers.uart_dma_buff, CLEAR, 
           sizeof(thread_low_trackers.uart_dma_buff)); 
    thread_low_trackers.buff_index = CLEAR; 
    memset((void *)thread_low_trackers.user_in_buff, CLEAR, 
           sizeof(thread_low_trackers.user_in_buff)); 
    thread_low_trackers.state_entry = SET_BIT; 
    thread_low_trackers.serial_out = SET_BIT; 
    thread_low_trackers.serial_in = CLEAR_BIT; 

    // Initialize UART 
    uart_init(
        USART2, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_DMA_DISABLE, 
        UART_DMA_ENABLE);   // RX DMA enabled for serial terminal reading 
    
    // Enable IDLE line interrupts for reading serial terminal input with DMA 
    uart_interrupt_init(
        USART2, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE, 
        UART_INT_ENABLE, 
        UART_INT_DISABLE, 
        UART_INT_DISABLE); 

    // Initialize the DMA stream 
    dma_stream_init(
        DMA1, 
        DMA1_Stream5, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_VHI, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE); 

    // Configure and enable the DMA stream 
    dma_stream_config(
        DMA1_Stream5, 
        (uint32_t)(&USART2->DR), 
        (uint32_t)thread_low_trackers.uart_dma_buff, 
        (uint16_t)SERIAL_INPUT_MAX_LEN); 
    dma_stream_enable(DMA1_Stream5); 

