samdonnelly/STM32F4-driver-test/sources/app_test/active_object_test.cpp
    // State machine 
    switch (state)
    {
        case THREAD_HIGH_LED_SLOW_STATE: 
            if (thread_high_trackers.led_fast)
            {
                state = THREAD_HIGH_LED_FAST_STATE; 
            }
            break; 

        case THREAD_HIGH_LED_FAST_STATE: 
            if (thread_high_trackers.led_slow)
            {
                state = THREAD_HIGH_LED_SLOW_STATE; 
            }
            break; 
        
        default: 
            state = THREAD_HIGH_LED_SLOW_STATE; 
            break; 
    }

    // Run state function 
    thread_high_state_table[state](&thread_high_trackers, event); 
    thread_high_trackers.state = state; 
}


// In practice the state functions would likely be in the same file as the function that 
// dispatched them. Each dispatching function would likely have its own file. 

// High Priority Thread: State 0 
void ThreadHighState0(
    ThreadHighTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_high_trackers.state_entry)
    {
        thread_high_trackers.state_entry = CLEAR_BIT; 

        xTimerStart(thread_high_trackers.slow_blink_timer, portMAX_DELAY); 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_HIGH_LED_TOGGLE_EVENT: 
            PinToggleEvent(
                thread_high_trackers.led_gpio, 
                thread_high_trackers.led_pin, 
                &thread_high_trackers.led_state); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_high_trackers.led_fast)
    {
        thread_high_trackers.state_entry = SET_BIT; 
        thread_high_trackers.led_slow = CLEAR_BIT; 

        xTimerStop(thread_high_trackers.slow_blink_timer, portMAX_DELAY); 
    }
}


// High Priority Thread: State 1 
void ThreadHighState1(
    ThreadHighTrackers *trackers, 
    Event event)
{
    // State entry 
    if (thread_high_trackers.state_entry)
    {
        thread_high_trackers.state_entry = CLEAR_BIT; 

        xTimerStart(thread_high_trackers.fast_blink_timer, portMAX_DELAY); 
    }

    // Event selection 
    switch (event)
    {
        case THREAD_HIGH_LED_TOGGLE_EVENT: 
            PinToggleEvent(
                thread_high_trackers.led_gpio, 
                thread_high_trackers.led_pin, 
                &thread_high_trackers.led_state); 
            break; 

        default: 
            break; 
    }

    // State exit 
    if (thread_high_trackers.led_slow)
    {
        thread_high_trackers.state_entry = SET_BIT; 
        thread_high_trackers.led_fast = CLEAR_BIT; 

        xTimerStop(thread_high_trackers.fast_blink_timer, portMAX_DELAY); 
    }
}


// Toggle the high priority thread state 
void ThreadHighStateToggle(void)
{
    // This is a sample setter function for the high priority thread. In practice, a 
    // function for state setters is probably not the best approach but this is done 
    // to separate thread crossover. 

    // Toggle the LED output state 
    thread_high_trackers.led_slow = SET_BIT - thread_high_trackers.led_slow; 
    thread_high_trackers.led_fast = SET_BIT - thread_high_trackers.led_fast; 

    // Queue an empty event to get the thread to change states and start blinking the 
    // LED at an updated rate immediately. 
    thread_high_trackers.event_data.event = THREAD_HIGH_NO_EVENT; 
    xQueueSend(thread_high_trackers.event_data.ThreadEventQueue, 
        (void *)&thread_high_trackers.event_data.event, 0); 
}

//=======================================================================================


//=======================================================================================
// Software Timer Thread 

// Called when LED toggle timers expire 
void LEDTimerCallback(TimerHandle_t xTimer)
{
    // Queue an LED toggle event 
    thread_high_trackers.event_data.event = THREAD_HIGH_LED_TOGGLE_EVENT; 
    xQueueSend(thread_high_trackers.event_data.ThreadEventQueue, 
        (void *)&thread_high_trackers.event_data.event, 0); 
}

//=======================================================================================


//=======================================================================================
// Event modules 

// In practice these would be independent modules that can be used wherever needed. 

// Event: Serial Output 
void SerialOutEvent(char *output_buff)
{
    if (output_buff != NULL)
    {
        // Output the latest content of the circular buffer to the serial terminal 
        uart_sendstring(USART2, "Echo: "); 
        uart_sendstring(USART2, (char *)thread_low_trackers.user_in_buff); 
        uart_sendstring(USART2, "\r\n>>> "); 
    }
}


// Event: Serial Input 
void SerialInEvent(
    uint8_t *circular_buff, 
    uint8_t *circular_buff_index, 
    uint8_t *input_buff)
{
    handler_flags.usart2_flag = CLEAR; 

    // Get the user input from the circular buffer 
    cb_parse(
        circular_buff, 
        input_buff, 
        circular_buff_index, 
        SERIAL_INPUT_MAX_LEN); 
}


// Event: Pin Toggle (used to toggle the board LED) 
void PinToggleEvent(
    GPIO_TypeDef *pin_gpio, 
    gpio_pin_num_t pin_num, 
    gpio_pin_state_t *pin_state)
{
    *pin_state = (gpio_pin_state_t)(GPIO_HIGH - *pin_state); 
    gpio_write(pin_gpio, pin_num, *pin_state); 
}

//=======================================================================================
